--[[
 __   ___________   ___     _____     __  __
/  |  |___   ___|  / _ \   | ___ }   |  \/  |
\_ \      | |     | | | |  | |_) }   | |\/| |
 _) |     | |     | |_| |  |  _< \   | |  | |
|__/      |_|      \___/   |_|  \_\  |_|  |_|
 BY @TAHAJ20 DEV : TAHAJ20            
--]]

local function run(msg)
msg.text = msg.content_.text_
if msg.text =="🌚" then
return  "• فـﮧديت صخـﮧامك🙊👄" 
end
if msg.text == "🌚🌚" then
return  "• فـﮧديت صخـﮧامك🙊👄" 
end
if msg.text == "🌚🌚🌚" then 
return  "• فـﮧديت صخـﮧامك🙊👄" 
end
if msg.text == "🌚🌚🌚🌚" then
return  "• فـﮧديت صخـﮧامك🙊👄" 
end
if msg.text =="🚶🏻" then 
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶ الماشي✨🚶🏻" 
end
if msg.text =="🚶🏻🚶🏻" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶ الماشي✨🚶🏻" 
end
if msg.text =="🚶🏻🚶🏻🚶🏻🚶🏻" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶ الماشي✨🚶🏻" 
end
if msg.text =="🚶🏻🚶🏻🚶🏻" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶ الماشي✨🚶🏻" 
end
if msg.text =="🙈" then
return  "» ﺷــ๋͜ـﮭڸ خــ๋͜ـجل ﮪ 💗😻̯͡" 
end
if msg.text =="🙈🙈" then
return  "» ﺷــ๋͜ـﮭڸ خــ๋͜ـجل ﮪ 💗😻̯͡" 
end
if msg.text =="🙈🙈🙈" then
return  "» ﺷــ๋͜ـﮭڸ خــ๋͜ـجل ﮪ 💗😻̯͡" 
end
if msg.text =="🙈🙈🙈🙈" then
return  "» ﺷــ๋͜ـﮭڸ خــ๋͜ـجل ﮪ 💗😻̯͡" 
end
if msg.text =="🙊🙊🙊🙊" then
return  "فديت الخجل يبن القرده 😹😹😢" 
end
if msg.text =="🙊🙊🙊" then
return  "فديت الخجل يبن القرده 😹😹😢"  
end
if msg.text =="🙊🙊" then
return  "فديت الخجل يبن القرده 😹😹😢" 
end
if msg.text =="🙊" then
return  "فديت الخجل يبن القرده 😹😹😢" 
end
if msg.text =="😍😍😍😍" then
return  "صعد الحب🙄 الله يستر😹💔 من الزحف 😂😹" 
end
if msg.text =="😍😍😍" then
return  "صعد الحب🙄 الله يستر😹💔 من الزحف 😂😹" 
end
if msg.text =="😍😍" then
return  "صعد الحب🙄 الله يستر😹💔 من الزحف 😂😹" 
end
if msg.text =="😍" then
return  "صعد الحب🙄 الله يستر😹💔 من الزحف 😂😹" 
end
if msg.text =="😂😂😂😂" then
return  "دوم الضحـكه😽🎈 " 
end
if msg.text =="😂😂😂" then
return  "دوم الضحـكه😽🎈 " 
end
if msg.text =="😂😂" then
return  "دوم الضحـكه😽🎈 " 
end
if msg.text =="😂" then
return  "دوم الضحـكه😽🎈 " 
end
if msg.text =="😉😉😉😉" then
return  "باع الغمزه 🙀 تموت 🙈🍃" 
end
if msg.text =="😉😉😉" then
return  "باع الغمزه 🙀 تموت 🙈🍃" 
end
if msg.text =="😉😉" then
return  "باع الغمزه 🙀 تموت 🙈🍃" 
end
if msg.text =="😉" then
return  "باع الغمزه 🙀 تموت 🙈🍃" 
end
if msg.text =="😳😳😳😳" then
return  "شبيك 🙀 مصدوم شنو 🙄 جديده عليك حتى تنصدم ♥️🍃" 
end
if msg.text =="😳😳😳" then
return  "شبيك 🙀 مصدوم شنو 🙄 جديده عليك حتى تنصدم ♥️🍃" 
end
if msg.text =="😳😳" then
return  "شبيك 🙀 مصدوم شنو 🙄 جديده عليك حتى تنصدم ♥️🍃" 
end
if msg.text =="😳" then
return  "شبيك 🙀 مصدوم شنو 🙄 جديده عليك حتى تنصدم ♥️🍃" 
end
if msg.text =="😠😠😠😠" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😠😠😠" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😠😠" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😠" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😡😡😡😡" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😡😡😡" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😡😡" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😡" then
return  "حمه الصيني طفوه 😍😹😹" 
end
if msg.text =="😭😭😭😭" then
return  "لا تبجي يروحي محد يسوه تبجيله ☺😘"
end 
if msg.text =="😭😭😭" then
return  "لا تبجي يروحي محد يسوه تبجيله ☺😘" 
end
if msg.text =="😭😭" then
return  "لا تبجي يروحي محد يسوه تبجيله ☺😘" 
end
if msg.text =="😭" then
return  "لا تبجي يروحي محد يسوه تبجيله ☺😘" 
end
if msg.text =="😌😌😌😌" then
return  "فديت 🙊😻 الرقه مالتك 😉😇🙊" 
end
if msg.text =="😌😌😌" then
return  "فديت 🙊😻 الرقه مالتك 😉😇🙊" 
end
if msg.text =="😌😌" then
return  "فديت 🙊😻 الرقه مالتك 😉😇🙊" 
end
if msg.text =="😌" then
return  "فديت 🙊😻 الرقه مالتك 😉😇🙊" 
end
if msg.text =="💃💃💃💃" then
return  "شددها ابو سميره 😂 خوش تهز 😹😹" 
end
if msg.text =="💃💃💃" then
return  "شددها ابو سميره 😂 خوش تهز 😹😹" 
end
if msg.text =="💃💃" then
return  "شددها ابو سميره 😂 خوش تهز 😹😹" 
end
if msg.text =="💃" then
return  "شددها ابو سميره 😂 خوش تهز 😹😹" 
end
if msg.text =="👀" then
return  "هاي وين دا تباوع ولك😹😹🙊" 
end
if msg.text =="👀👀" then
return  "هاي وين دا تباوع ولك😹😹🙊" 
end
if msg.text =="😱😱😱😱" then
return  "عزا العزاك هاي شفت ولك 😂😂😍" 
end
if msg.text =="😱😱😱" then
return  "عزا العزاك هاي شفت ولك 😂😂😍" 
end
if msg.text =="😱😱" then
return  "عزا العزاك هاي شفت ولك 😂😂😍" 
end
if msg.text =="😱" then
return  "عزا العزاك هاي شفت ولك 😂😂😍" 
end
if msg.text =="😊😊😊😊" then
return  "فديت الخجل كله 😎😍" 
end
if msg.text =="😊😊😊" then
return  "فديت الخجل كله 😎😍" 
end
if msg.text =="😊😊" then
return  "فديت الخجل كله 😎😍" 
end
if msg.text =="😊" then
return  "فديت الخجل كله 😎😍" 
end
if msg.text =="😘😘😘😘" then
return  "• ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘" 
end
if msg.text =="😘😘😘" then
return  "• ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘" 
end
if msg.text =="😘😘" then
return  "• ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘" 
end
if msg.text =="😘" then
return  "• ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘" 
end
if msg.text =="☺☺☺☺" then
return  "ابتسامه مال واحد شايل اهموم الدنيا كوله بگلبه 💔😿"
end
if msg.text =="☺☺☺" then
return  "ابتسامه مال واحد شايل اهموم الدنيا كوله بگلبه 💔😿"
end
if msg.text =="☺☺" then
return  "ابتسامه مال واحد شايل اهموم الدنيا كوله بگلبه 💔😿"
end
if msg.text =="☺" then
return  "ابتسامه مال واحد شايل اهموم الدنيا كوله بگلبه 💔😿"
end
if msg.text =="😞😞😞😞" then
return  "منو مضوجك🙀 دليني عليه😾💪🏼" 
end
if msg.text =="😞😞😞" then
return  "منو مضوجك🙀 دليني عليه😾💪🏼" 
end
if msg.text =="😞😞" then
return  "منو مضوجك🙀 دليني عليه😾💪🏼" 
end
if msg.text =="😞" then
return  "منو مضوجك🙀 دليني عليه😾💪🏼" 
end
if msg.text =="😻😻😻😻" then
return  "باع الحب صاعد عده فول 😹😻" 
end
if msg.text =="😻😻😻" then
return  "باع الحب صاعد عده فول 😹😻" 
end
if msg.text =="😻😻" then
return  "باع الحب صاعد عده فول 😹😻" 
end
if msg.text =="😻" then
return  "باع الحب صاعد عده فول 😹😻" 
end
if msg.text =="😇" then
return  "مسويلك مصيبه ودا تبتسم 😻😹😹😹" 
end
if msg.text =="😇😇" then
return  "مسويلك مصيبه ودا تبتسم 😻😹😹😹" 
end
if msg.text =="🚶" then
return  "منور يبعد الكلب 🌺😻😇" 
end
if msg.text =="🚶🚶" then
return  "منور يبعد الكلب 🌺😻😇" 
end
if msg.text =="🚶🚶🚶" then
return  "منور يبعد الكلب 🌺😻😇" 
end
if msg.text =="🚶🚶🚶🚶" then
return  "منور يبعد الكلب 🌺😻😇" 
end
if msg.text =="😢😢😢😢" then
return  "عيـ😻ـونك/ج✨ حرام ينزل😴 دمعهن🙊" 
end
if msg.text =="😢😢😢" then
return  "عيـ😻ـونك/ج✨ حرام ينزل😴 دمعهن🙊" 
end
if msg.text =="😢😢" then
return  "عيـ😻ـونك/ج✨ حرام ينزل😴 دمعهن🙊" 
end
if msg.text =="😢" then
return  "عيـ😻ـونك/ج✨ حرام ينزل😴 دمعهن🙊" 
end
if msg.text =="😹😹😹😹" then
return  "دوم الضحكه يالغالي 😻" 
end
if msg.text =="😹😹😹" then
return  "دوم الضحكه يالغالي 😻"
end
if msg.text =="😹😹" then
return  "دوم الضحكه يالغالي 😻"
end
if msg.text =="😹" then
return  "دوم الضحكه يالغالي 😻"
end
if msg.text =="😿😿😿😿" then
return  "منو وياك يرويحتي 😓😻" 
end
if msg.text =="😿😿😿" then
return  "منو وياك يرويحتي 😓😻" 
end
if msg.text =="😿😿" then
return  "منو وياك يرويحتي 😓😻" 
end
if msg.text =="😿" then
return  "منو وياك يرويحتي 😓😻" 
end
if msg.text =="😏😏😏😏" then
return  "عود شوفوني اني شخصـية 😣وهو وجـهه وجه الطلي 🙊😹😹" 
end
if msg.text =="😏😏😏" then
return  "عود شوفوني اني شخصـية 😣وهو وجـهه وجه الطلي 🙊😹😹" 
end
if msg.text =="😏😏" then
return  "عود شوفوني اني شخصـية 😣وهو وجـهه وجه الطلي 🙊😹😹" 
end
if msg.text =="😏" then
return  "عود شوفوني اني شخصـية 😣وهو وجـهه وجه الطلي 🙊😹😹" 
end
if msg.text =="😒😒😒😒" then
return  "شبي🙃 ‎‏💛🙈  ggɺᓗɺÎ  ضايج💔" 
end
if msg.text =="😒😒😒" then
return  "شبي🙃 ‎‏💛??  ggɺᓗɺÎ  ضايج💔" 
end
if msg.text =="😒😒" then
return  "شبي🙃 ‎‏💛🙈  ggɺᓗɺÎ  ضايج💔" 
end
if msg.text =="😒" then
return  "شبي🙃 ‎‏💛🙈  ggɺᓗɺÎ  ضايج💔" 
end
if msg.text =="😝😝😝😝" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😝😝😝" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😝😝" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😝" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😕😕😕" then
return  "شكو عاوج حلكك😒😻😹😹" 
end
if msg.text =="😕😕" then
return  "شكو عاوج حلكك😒😻😹😹" 
end
if msg.text =="😕" then
return  "شكو عاوج حلكك😒😻😹😹" 
end
if msg.text =="🚶‍♀️🚶‍♀️🚶‍♀️🚶‍♀️" then
return  "- الجمال البـيـج فـاتح للـغغزل چم بـاب💅🏻💛" 
end
if msg.text =="🚶‍♀️🚶‍♀️🚶‍♀️" then
return  "- الجمال البـيـج فـاتح للـغغزل چم بـاب💅🏻💛" 
end
if msg.text =="🚶‍♀️🚶‍♀️" then
return  "- الجمال البـيـج فـاتح للـغغزل چم بـاب💅🏻💛" 
end
if msg.text =="🚶‍♀️" then
return  "- الجمال البـيـج فـاتح للـغغزل چم بـاب💅🏻💛" 
end
if msg.text =="🚶🏻🚶🏻🚶🏻🚶🏻" then
return  "- الجمال البـيـك فـاتح للـغغزل چم بـاب💛" 
end
if msg.text =="🚶🏻🚶🏻🚶🏻" then
return  "- الجمال البـيـك فـاتح للـغغزل چم بـاب💛" 
end
if msg.text =="🚶🏻🚶🏻" then
return  "- الجمال البـيـك فـاتح للـغغزل چم بـاب💛" 
end
if msg.text =="🚶🏻" then
return  "- الجمال البـيـك فـاتح للـغغزل چم بـاب💛"
end 
if msg.text =="😔😔😔😔" then
return  "ليش زعلان يعمري 😔 تعال احجيلي اهمومك💔🍃"
end 
if msg.text =="😔😔😔" then
return  "ليش زعلان يعمري 😔 تعال احجيلي اهمومك💔🍃" 
end
if msg.text =="😔😔" then
return  "ليش زعلان يعمري 😔 تعال احجيلي اهمومك💔🍃" 
end
if msg.text =="😔" then
return  "ليش زعلان يعمري 😔 تعال احجيلي اهمومك💔🍃" 
end
if msg.text =="😑😑😑😑" then
return  "منو مضوجك☹️ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="😑😑😑" then
return  "منو مضوجك☹️ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="😑😑" then
return  "منو مضوجك☹️ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="😑" then
return  "منو مضوجك☹️ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="😐😐😐😐" then
return  "شبيك ضايج يروحي 😓😭" 
end
if msg.text =="😐😐😐" then
return  "شبيك ضايج يروحي 😓😭"
end
if msg.text =="😐😐" then
return  "شبيك ضايج يروحي 😓😭"
end
if msg.text =="😐" then
return  "شبيك ضايج يروحي 😓😭"
end
if msg.text =="😋😋😋😋" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😋😋😋" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😋😋" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😋" then
return  "لو جوعان 🤔لو مريض نفسي😹💔" 
end
if msg.text =="😎😎😎😎" then
return  "مسوي عمليه لعيونك 😔 لو انت خبل🙌😿"
end
if msg.text =="😎😎😎" then
return  "مسوي عمليه لعيونك 😔 لو انت خبل🙌😿"
end
if msg.text =="😎😎" then
return  "مسوي عمليه لعيونك 😔 لو انت خبل🙌😿"
end
if msg.text =="😎" then
return  "مسوي عمليه لعيونك 😔 لو انت خبل🙌😿"
end
if msg.text =="😴😴😴😴" then
return  "رأح, دكـّــوم تـّــمس๋͜‏ـلّـ๋͜‏ـت ولي نأم 😹☹️😻  " 
end
if msg.text =="😴😴😴" then
return  "رأح, دكـّــوم تـّــمس๋͜‏ـلّـ๋͜‏ـت ولي نأم 😹☹️😻  " 
end
if msg.text =="😴😴" then
return  "رأح, دكـّــوم تـّــمس๋͜‏ـلّـ๋͜‏ـت ولي نأم 😹☹️😻  " 
end
if msg.text =="😴" then
return  "رأح, دكـّــوم تـّــمس๋͜‏ـلّـ๋͜‏ـت ولي نأم 😹☹️😻  " 
end
if msg.text =="😽😽😽😽" then
return  " ﭑإ́وُف فديـٍَــت ﭑإ́لـپـــٰٰـوُﮨﮨﮨــهٰ⇣̉ـ  😻🙈🙊" 
end
if msg.text =="😽😽😽" then
return  " ﭑإ́وُف فديـٍَــت ﭑإ́لـپـــٰٰـوُﮨﮨﮨــهٰ⇣̉ـ  😻🙈🙊" 
end
if msg.text =="😽😽" then
return  " ﭑإ́وُف فديـٍَــت ﭑإ́لـپـــٰٰـوُﮨﮨﮨــهٰ⇣̉ـ  😻🙈🙊" 
end
if msg.text =="😽" then
return  " ﭑإ́وُف فديـٍَــت ﭑإ́لـپـــٰٰـوُﮨﮨﮨــهٰ⇣̉ـ  😻🙈🙊" 
end
if msg.text =="😾😾" then
return  "خاب ديلك😐😹" 
end
if msg.text =="😾" then
return  "خاب ديلك😐😹" 
end
if msg.text =="💔" then
return  "ﭑإ́وُف ﭑإ́لـلــهٰ⇣̉ يـٍَﮩﮨﮨﮨـﭑإ́عـِِِِد قلـپـــٰٰـك 😢😞💋 " 
end
if msg.text =="💔💔" then
return  "ﭑإ́وُف ﭑإ́لـلــهٰ⇣̉ يـٍَﮩﮨﮨﮨـﭑإ́عـِِِِد قلـپـــٰٰـك 😢😞💋 " 
end
if msg.text =="💔💔💔" then
return  "ﭑإ́وُف ﭑإ́لـلــهٰ⇣̉ يـٍَﮩﮨﮨﮨـﭑإ́عـِِِِد قلـپـــٰٰـك 😢😞💋 " 
end
if msg.text =="💔💔💔💔" then
return  "ﭑإ́وُف ﭑإ́لـلــهٰ⇣̉ يـٍَﮩﮨﮨﮨـﭑإ́عـِِِِد قلـپـــٰٰـك 😢😞💋 " 
end
if msg.text =="💛" then
return  "قلبوشتي😻💋" 
end
if msg.text =="💙" then
return  "عافيتي😻💋" 
end
if msg.text =="💜" then
return  "يروحي😻💋انت" 
end
if msg.text =="❤" then
return  "يعمري😻💋 انت " 
end
if msg.text =="💚" then
return  "منور ابو كلب الاخضر😐😹" 
end
if msg.text =="💋💋💋💋" then
return  "اوووف شنو هذا الحلك😻" 
end
if msg.text =="💋💋💋" then
return  "اوووف شنو هذا الحلك😻" 
end
if msg.text =="💋💋" then
return  "اوووف شنو هذا الحلك😻" 
end
if msg.text =="💋" then
return  "اوووف شنو هذا الحلك😻" 
end
if msg.text =="🙋" then
return  "هلا حبعمري🙂❤️" 
end
if msg.text =="🙋🙋" then
return  "هلا حبعمري🙂❤️" 
end
if msg.text =="🙋🙋🙋" then
return  "هلا حبعمري🙂❤️" 
end
if msg.text =="🐕" then
return  "ها عمو شبيك🌝💔" 
end
if msg.text =="🐆" then
return  "ولا يكعد راحه ابو صابر🌝😹" 
end
if msg.text =="🐈" then
return  "بشت بشت😐😹" 
end
if msg.text =="🌹🌹" then
return  "هلا حياتي عطرها🙂💋" 
end
if msg.text =="🌹" then
return  "هلا حياتي عطرها🙂💋" 
end
if msg.text =="🌝🌝🌝🌝" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶" 
end
if msg.text =="🌝🌝🌝" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶" 
end
if msg.text =="🌝🌝" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶" 
end
if msg.text =="🌝" then
return  "شـﮫـۛالـٰٰ̲ضـِۛـوٰ୭ٰۛٳٲ 🌝💙 ۶" 
end
if msg.text =="🐍" then
return  "ماكو غيرك زاحف🙊🗯" 
end
if msg.text =="🐍🐍" then
return  "ماكو غيرك زاحف🙊🗯" 
end
if msg.text =="🐍🐍🐍" then
return  "ماكو غيرك زاحف🙊🗯" 
end
if msg.text =="🐍🐍🐍🐍" then
return  "ماكو غيرك زاحف🙊🗯" 
end
if msg.text =="🐅" then
return  "منور النجر🌝😹" 
end
if msg.text =="🐅🐅" then
return  "منور النجر🌝😹" 
end
if msg.text =="🐅🐅🐅" then
return  " منورالنجر🌝💋 " 
end
if msg.text =="🌺" then
return  "عطرها حبي🌝💋" 
end
if msg.text =="🍁" then
return  "عطرها حبي🌝💋" 
end
if msg.text =="💐" then
return  "عطرها حبي🌝💋"
end
if msg.text =="🙄🙄🙄🙄" then
return  "شلگيت فوگ وتباوع🤔لو انت احول🙄💔" 
end
if msg.text =="🙄🙄🙄" then
return  "شلگيت فوگ وتباوع🤔لو انت احول🙄💔" 
end
if msg.text =="🙄🙄" then
return  "شلگيت فوگ وتباوع🤔لو انت احول🙄💔" 
end
if msg.text =="🙄" then
return  "شلگيت فوگ وتباوع🤔لو انت احول🙄💔" 
end
if msg.text =="طه" then
return  "ﭑإ́لـــﻤ̉̉ـطوُر ﻤ̉̉ـﭑإ́لـــﺗـ͜͡ہــٍّـــِّي إ́لـــعـُُـﮨ́́ﮨ́ﮨق فديـٍّــتـِّـّٰٰ̐ـ͜͜͡ާـه \n@TAHAJ20" 
end
if msg.text =="خليجي" then
return  "ﭑإ́لـــﻤ̉̉ـطوُر ﻤ̉̉ـﭑإ́لـــﺗـ͜͡ہــٍّـــِّي إ́لـــعـُُـﮨ́́ﮨ́ﮨق فديـٍّــتـِّـّٰٰ̐ـ͜͜͡ާـه \n@TAHAJ20"
end
if msg.text =="خليجي صاك" then
return  "ﭑإ́لـــﻤ̉̉ـطوُر ﻤ̉̉ـﭑإ́لـــﺗـ͜͡ہــٍّـــِّي إ́لـــعـُُـﮨ́́ﮨ́ﮨق فديـٍّــتـِّـّٰٰ̐ـ͜͜͡ާـه \n@TAHAJ20"
end
if msg.text =="@TAHAJ20" then
return  "ﭑإ́لـــﻤ̉̉ـطوُر ﻤ̉̉ـﭑإ́لـــﺗـ͜͡ہــٍّـــِّي إ́لـــعـُُـﮨ́́ﮨ́ﮨق فديـٍّــتـِّـّٰٰ̐ـ͜͜͡ާـه \n@TAHAJ20"
end
if msg.text =="اريد قناة" then
return  "تفضل حياتي @TEAMSTORM" 
end
if msg.text =="قناة" then
return  "تفضل حياتي @TEAMSTORM" 
end
if msg.text =="اريد قناه" then
return  "تفضل حياتي @TEAMSTORM" 
end
if msg.text =="قناه" then
return  "تفضل حياتي @TEAMSTORM" 
end
if msg.text =="نرتبط" then
return  "ولك ما تبطل زحفك 😡😹 صارت قديمه ترا 😂🙊" 
end
if msg.text =="نكبل" then
return  "ولك ما تبطل زحفك 😡😹 صارت قديمه ترا 😂🙊" 
end
if msg.text =="عرفينا" then
return  "ولك ما تبطل زحفك 😡😹 صارت قديمه ترا 😂🙊" 
end
if msg.text =="نتعرف" then
return  "ولك ما تبطل زحفك 😡😹 صارت قديمه ترا 😂🙊" 
end
if msg.text =="نت منين" then
return  "شكو تزحف ولك 😹😹 خلوني بس اني ازحف 🙊😹😿" 
end
if msg.text =="خلي نتعرف" then
return  "شكو تزحف ولك 😹😹 خلوني بس اني ازحف 🙊😹😿" 
end
if msg.text =="شسمك" then
return  "شكو تزحف ولك 😹😹 خلوني بس اني ازحف 🙊😹😿" 
end
if msg.text =="عرفنا" then
return  "شكو تزحف ولك 😹😹 خلوني بس اني ازحف 🙊😹😿" 
end
if msg.text =="هاذا شنو" then
return  "لۧاٲ   مو بوت😒 اقرا🙃 اسمي✨" 
end
if msg.text =="يمكن بوت" then
return  "لۧاٲ   مو بوت😒 اقرا🙃 اسمي✨" 
end
if msg.text =="اي بوت" then
return  "لۧاٲ   مو بوت😒 اقرا🙃 اسمي✨" 
end
if msg.text =="هاذا بوت" then
return  "لۧاٲ   مو بوت😒 اقرا🙃 اسمي✨" 
end
if msg.text =="وين البوت" then
return  "لۧاٲ   مو بوت😒 اقرا🙃 اسمي✨" 
end
if msg.text =="المطور" then
return  "مايريد ينيجكم كوة هيه عوفوه 😾🖕🏻" 
end
if msg.text =="مطور" then
return  "مايريد ينيجكم كوة هيه عوفوه 😾🖕🏻"
end
if msg.text =="تعال نلعب" then
return  "تعالو لعبو بمالي 😸😸" 
end
if msg.text =="تعاي نلعب" then
return  "تعالو لعبو بمالي 😸😸" 
end
if msg.text =="نلعب" then
return  "تعالو لعبو بمالي 😸😸" 
end
if msg.text =="تلعبون" then
return  "تعالو لعبو بمالي 😸😸" 
end
if msg.text =="🤔🤔🤔🤔" then
return  "ولا يكعد راحه اينشتاين الصغير 😂😂" 
end
if msg.text =="🤔🤔🤔" then
return  "ولا يكعد راحه اينشتاين الصغير 😂😂" 
end
if msg.text =="🤔🤔" then
return  "ولا يكعد راحه اينشتاين الصغير 😂😂" 
end
if msg.text =="🤔" then
return  "ولا يكعد راحه اينشتاين الصغير 😂😂" 
end
if msg.text =="🖕🖕🖕🖕" then
return  "بحي هاذا لوفه وحطه فتيزك 😹😹😻" 
end
if msg.text =="🖕🖕🖕" then
return  "بحي هاذا لوفه وحطه فتيزك 😹😹😻" 
end
if msg.text =="🖕🖕" then
return  "بحي هاذا لوفه وحطه فتيزك 😹😹😻" 
end
if msg.text =="🖕" then
return  "بحي هاذا لوفه وحطه فتيزك 😹😹😻" 
end
if msg.text =="💋💋💋💋" then
return  "فديتك حلكك بحي ☹😹" 
end
if msg.text =="💋💋💋" then
return  "فديتك حلكك بحي ☹😹" 
end
if msg.text =="💋💋" then
return  "فديتك حلكك بحي ☹😹" 
end
if msg.text =="💋" then
return  "فديتك حلكك بحي ☹😹" 
end
if msg.text =="تصبح عله خير" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="راح انام" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="نعسان" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="ت ع خ" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="تصبحون عله خير" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="تصبحي عله خير" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="تصبحين عله خير" then
return  "روح نام 😍😉 حياتي 😌 تصبح عله خير 💋" 
end
if msg.text =="صباحووو" then
return  "صباحو النور يا نور 😻😹" 
end
if msg.text =="صباحو" then
return  "صباحو النور يا نور 😻😹" 
end
if msg.text =="صباحوو" then
return  "صباحو النور يا نور 😻😹" 
end
if msg.text =="صباح الخير" then
return  "صباحو النور يا نور 😻😹" 
end
if msg.text =="دوووم" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="دووووم" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="دوم" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="ددوم" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="دومك" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="دومج" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="ادوم" then
return  "لله يديم انفاسك/ج 😇😚" 
end
if msg.text =="شونج" then
return  "تمام وانت/ي شلونك/ج 😻🙊" 
end
if msg.text =="شلونج" then
return  "تمام وانت/ي شلونك/ج 😻🙊" 
end
if msg.text =="شخبارج" then
return  "تمام وانت/ي شلونك/ج 😻🙊" 
end
if msg.text =="شلونجن" then
return  "تمام وانت/ي شلونك/ج 😻🙊" 
end
if msg.text =="ضايجه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ🕺🏻ـصلج🌚" 
end
if msg.text =="ضايجهه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ🕺🏻ـصلج🌚" 
end
if msg.text =="حيل ضايجه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ🕺🏻ـصلج🌚" 
end
if msg.text =="ضووجهه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ🕺🏻ـصلج🌚" 
end
if msg.text =="ضوججه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ💃🏻ـصلك🌝" 
end
if msg.text =="ضوجهه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ💃🏻ـصلك🌝" 
end
if msg.text =="ضوجه" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ💃🏻ـصلك🌝" 
end
if msg.text =="ضايجين" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ💃🏻ـصلك🌝" 
end
if msg.text =="ضايج" then
return  "حـٍبيبي ءّ🙍‍♂️💜 اركـ💃🏻ـصلك🌝" 
end
if msg.text =="اروح" then
return  "مٰٝـٍْ✋ۡـٍٰآ ترٰوۢۛඋ ،💛  احد لازمك🤦🏻‍♂️" 
end
if msg.text =="اروحح" then
return  "مٰٝـٍْ✋ۡـٍٰآ ترٰوۢۛඋ ،💛  احد لازمك🤦🏻‍♂️" 
end
if msg.text =="راح اروح" then
return  "مٰٝـٍْ✋ۡـٍٰآ ترٰوۢۛඋ ،💛  احد لازمك🤦🏻‍♂️" 
end
if msg.text =="رايح" then
return  "مٰٝـٍْ✋ۡـٍٰآ ترٰوۢۛඋ ،💛  احد لازمك🤦🏻‍♂️" 
end
if msg.text =="اجيييي" then
return  "ﮪﮪﮧעّ ⁞⁞ُ͡‏   💗 بيك🚶🏻 حمبي 👻" 
end
if msg.text =="اجي" then
return  "ﮪﮪﮧעّ ⁞⁞ُ͡‏   💗 بيك🚶🏻 حمبي 👻" 
end
if msg.text =="اجييي" then
return  "ﮪﮪﮧעّ ⁞⁞ُ͡‏   💗 بيك🚶🏻 حمبي 👻" 
end
if msg.text =="ممكنن" then
return  "أإآيٰٰ    تـٴِﮧ﴿🚶🏻﴾ۣـعالۂ͡†♩❥"
end
if msg.text =="ممكن" then
return  "أإآيٰٰ    تـٴِﮧ﴿🚶🏻﴾ۣـعالۂ͡†♩❥"
end
if msg.text =="ببكن" then
return  "أإآيٰٰ    تـٴِﮧ﴿🚶🏻﴾ۣـعالۂ͡†♩❥"
end
if msg.text =="مممكن" then
return  "أإآيٰٰ    تـٴِﮧ﴿🚶🏻﴾ۣـعالۂ͡†♩❥"
end
if msg.text =="ديييي" then
return  "يمشوك🐕 بيها🙊😹 حمبي" 
end
if msg.text =="دييي" then
return  "يمشوك🐕 بيها🙊😹 حمبي" 
end
if msg.text =="ديي" then
return  "يمشوك🐕 بيها🙊😹 حمبي" 
end
if msg.text =="دي" then
return  "يمشوك🐕 بيها🙊😹 حمبي" 
end
if msg.text =="وليييي" then
return  "۽ﺈنجٰٓجٰٓہ͡‌ـبۂ 🌝 ٰٓ₎ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="ولييي" then
return  "۽ﺈنجٰٓجٰٓہ͡‌ـبۂ 🌝 ٰٓ₎ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="وليي" then
return  "۽ﺈنجٰٓجٰٓہ͡‌ـبۂ 🌝 ٰٓ₎ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="ولي" then
return  "۽ﺈنجٰٓجٰٓہ͡‌ـبۂ 🌝 ٰٓ₎ פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="احبكك" then
return  "بعد روحي واني احبكم هم بس لتزحفلي رجاا 😸😸💋" 
end
if msg.text =="ااحبك" then
return  "بعد روحي واني احبكم هم بس لتزحفلي رجاا 😸😸💋" 
end
if msg.text =="احبككك" then
return  "بعد روحي واني احبكم هم بس لتزحفلي رجاا 😸😸💋" 
end
if msg.text =="احبكم" then
return  "بعد روحي واني احبكم هم بس لتزحفلي رجاا 😸😸💋" 
end
if msg.text =="اييييي" then
return  "يب قابل اغشكم 🙈🎈" 
end
if msg.text =="اييي" then
return  "يب قابل اغشكم 🙈🎈" 
end
if msg.text =="ايي" then
return  "يب قابل اغشكم 🙈🎈" 
end
if msg.text =="اي" then
return  "يب قابل اغشكم 🙈🎈" 
end
if msg.text =="تعالو" then
return  " ما اروح المطورين مالتي ميقبلون😐🎈 " 
end
if msg.text =="تعالوو" then
return  "لا ما اروح المطورين مالتي ميقبلون😐🎈" 
end
if msg.text =="تعالووو" then
return  "لا ما اروح المطورين مالتي ميقبلون😐🎈" 
end
if msg.text =="تعالوووو" then
return  "لا ما اروح المطورين مالتي ميقبلون😐🎈" 
end
if msg.text =="شبيك" then
return  "مبينه شي سلامتك/ ج🎈😌" 
end
if msg.text =="شبيكم" then
return  "مبينه شي سلامتك/ ج🎈😌"  
end
if msg.text =="شبيكك" then
return  "مبينه شي سلامتك/ ج🎈😌" 
end
if msg.text =="شبيكمم" then
return "مبينه شي سلامتك/ ج🎈😌" 
end
if msg.text =="جب" then
return  "جب بخشـ👃🏻ـمك פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="انجب" then
return  "جب بخشـ👃🏻ـمك פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="نجب" then
return  "جب بخشـ👃🏻ـمك פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="اانجب" then
return  "جب بخشـ👃🏻ـمك פـٍـٍبيبي ءّ🙍‍♂️💜" 
end
if msg.text =="وين" then
return  "• بٌِٰـﮧﮧأرِٰض اَٰلْٰلْٰهَٰہۧ اَٰلْٰـہوٍّاَٰسٌٍعٍِّـﮧهَٰہۧ😽💜ֆ" 
end
if msg.text =="وينن" then
return  "• بٌِٰـﮧﮧأرِٰض اَٰلْٰلْٰهَٰہۧ اَٰلْٰـہوٍّاَٰسٌٍعٍِّـﮧهَٰہۧ😽💜ֆ" 
end
if msg.text =="وين تريد" then
return  "• بٌِٰـﮧﮧأرِٰض اَٰلْٰلْٰهَٰہۧ اَٰلْٰـہوٍّاَٰسٌٍعٍِّـﮧهَٰہۧ😽💜ֆ" 
end
if msg.text =="ووين" then
return  "• بٌِٰـﮧﮧأرِٰض اَٰلْٰلْٰهَٰہۧ اَٰلْٰـہوٍّاَٰسٌٍعٍِّـﮧهَٰہۧ😽💜ֆ" 
end
if msg.text =="باي" then
return  "لله وياكـ💙✨ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘"
end
if msg.text =="بااي" then
return  "لله وياكـ💙✨ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘"
end
if msg.text =="باااي" then
return  "لله وياكـ💙✨ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘"
end
if msg.text =="باااااي" then
return  "لله وياكـ💙✨ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘"
end
if msg.text =="بايي" then
return  "لله وياكـ💙✨ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘"
end
if msg.text =="باييي" then
return  "لله وياكـ💙✨ يا • ﻋٰۧﻋٰ̯ۧـسۂﻝَُّ↵⁽🍯̯⁾ֆ‘"
end
if msg.text =="شلونكم" then
return  "آلـْ ح ـمـِْدِّ اللّـٰھ وانٓــتــٰـہ/ي ࿐❥ 🌎🌸" 
end
if msg.text =="شلونك" then
return  "آلـْ ح ـمـِْدِّ اللّـٰھ وانٓــتــٰـہ/ي ࿐❥ 🌎🌸" 
end
if msg.text =="شونك" then
return  "آلـْ ح ـمـِْدِّ اللّـٰھ وانٓــتــٰـہ/ي ࿐❥ 🌎🌸" 
end
if msg.text =="شونكم" then
return  "آلـْ ح ـمـِْدِّ اللّـٰھ وانٓــتــٰـہ/ي ࿐❥ 🌎🌸" 
end
if msg.text =="☹️☹️☹️☹️" then
return "شبيك متعصب حبي 😱😿 منو وياك 😿😹😹"
end
if msg.text =="☹️☹️☹️" then
return "شبيك متعصب حبي 😱😿 منو وياك 😿😹😹"
end
if msg.text =="☹️☹️" then
return "شبيك متعصب حبي 😱😿 منو وياك 😿😹😹"
end
if msg.text =="☹️" then
return "شبيك متعصب حبي 😱😿 منو وياك 😿😹😹"
end
if msg.text =="🙂🙂🙂🙂" then
return "اوف شهل الابتسامه احله من الكمر 😎😻😻😹"
end
if msg.text =="😕😕😕😕" then
return "شكو عاوج حلكك😒😻😹😹"
end
if msg.text =="🙄🤞🏿" then
return "شبيك صافن على ايدك 😹😹😹"
end
if msg.text =="🙁💔" then
return "ضايج لئن كلبه مكسور 🙀😿"
end
if msg.text =="🙂✌️" then
return "مبتسم على وجهي 😌😹😹😹😹"
end
if msg.text =="هه" then
return "ضحكتك 🚶 مال فروخ 😿 بطلها 😹😹😹"
end
if msg.text =="ههه" then
return "دوم حياتي مو يوم 🌹😻"
end
if msg.text =="هههه" then
return "دومها يل قالي 😻😹😹"
end
if msg.text =="ههههه" then
return "دوم الضحكه بعد كلبي انت 😍🙊"
end
if msg.text =="هههههه" then
return "كافي تضخك 😒 انت مو زغير 😎😻😹"
end
if msg.text =="ههههههه" then
return "كافي تضخك 😒 انت مو زغير 😎😻😹"
end
if msg.text =="هههههههه" then
return "كافي تضخك 😒 انت مو زغير 😎😻😹"
end
if msg.text =="ههههههههه" then
return "انت شبيك تخبلت 😒😨😹😹"
end
if msg.text =="هههههههههه" then
return "انت شبيك تخبلت 😒😨😹😹"
end
if msg.text =="😹😹😹😹😹😹😹" then
return "انت شبيك تخبلت 😒😨😹😹"
end
if msg.text =="😹😹😹😹😹😹😹😹😹😹" then
return "انت شبيك تخبلت 😒😨😹😹"
end
if msg.text =="بربك" then 
return "ي وعلي ابو الحسن 😐💔" 
end
if msg.text =="كلكم" then 
return "ليش تجمع بحي اني بوت 😞💔" 
end
if msg.text =="والرب" then 
return "استغفر الله جنان كم مره كتلك لتحلف جذب😑🎈" 
end
if msg.text =="حقك" then 
return "ي حقك حمبي اني وياك ضدهم😐🎈" 
end
if msg.text =="اكلك" then 
return  "كول حبي بس لا تبول علينا 😸💛" 
end
if msg.text =="اكول" then 
return  "كول وفتح حلكك خل ابول 😸😸🙊" 
end
if msg.text =="احبج" then 
return  "ولكم زاحف دفره قبل لا يتكاثر بل كروب 😸😸😸💛" 
end
if msg.text =="خاص" then 
return  "اسف مرتبط ويه بنت عمك 😸😸💙" 
end
if msg.text =="تعال خاص" then 
return  "ها ها تريدون تلعبون بدلي 😸😸💑" 
end
if msg.text =="تعالي خاص" then 
return  "ها ها 😸 عود هم كول ما ازحف وهاي كمشتك😸💛" 
end
if msg.text =="تعال" then 
return  "ولي لك ليريدني هو يجيني 😸🌞" 
end
if msg.text =="صوفي" then
return  "فديته هاذا اخوي ابو الوكفات فديت ابنمي😍😍"
end 
if msg.text =="شغال" then
return  "❞ ءيہـ͜ާي ۶ـٰٰٰོۂٰٰٰٰٰزيہزيۂٰٰٰٰٰـﮯ بـہٰٖآﻗقــ͡ي ﯙأتۂـ͜مــٰཻدد 🤓💕" 
end
if msg.text =="فرخ" then
return  "• ؤخـٰٰ͒ہر آﻧﮧـ͜ާۂٰٰٰٰٰي ڵہٰٰٖٖكي᪼᪳ـۂتہٰٖـﮫﮧٰٰٖٖ 😋۶ֆ كبلك" 
end
if msg.text =="نصعد" then
return "مكالمهةة لو زرور 🐸🤘🏿"
end
if msg.text =="وف" then
return "مو كتلج اريحج لتخافين 🌝💦"
end
if msg.text =="اوي" then
return "هاي تفله بعد ميعور حمبي 🌚💦"
end
if msg.text =="كحبه" then
return "يب ادري بيها حته ناجها سويجد 😹"
end
if msg.text =="يوجع" then
return "حته ترتاحين يا عيني 😺"
end
if msg.text =="ولو منا" then
return "ماولي اذا ما انيجكم 😼🤘🏻"
end
if msg.text =="الله" then
return "شبي خوما ضوجك خوما كللهم مايكل ناج هذا 🙀🙌🏻"
end
if msg.text =="نيجه" then
return "تعال بعد عمك افتر وما تحس وي التفال 🐸💚"
end
if msg.text =="كول انجب" then
return "خايب ولي لاتفل بطيزك ينطيني اوامر الفرخ 🤘🏿🤡🤘🏿"
end
if msg.text =="انكليزي" then
return "فاج يو ماين 😎"
end
if msg.text =="مرحبا" then 
return  " مہٰ۪۫ږآحہٰ۪۫بہٰ۪۫ هلا بيك 💑💋" 
end
if msg.text =="هاي" then 
return  "يههلا بيك حياتي 💛🌿" 
end
if msg.text =="شلونكم" then 
return  " تہۣۧمہۣۧﭑمہۣۧ بحي وانت شخبار 💛🌿" 
end
if msg.text =="هلاوووووو" then 
return  "يههلا بيك نورتنا 💛" 
end
if msg.text =="خرب" then 
return  "خرب وجهك حمتر لتكفر 🌞🌿 " 
end
if msg.text =="سلام" then 
return  "يهلا حمبي نورت 💛😻" 
end
if msg.text =="انت انجب" then 
return  "اي حمبي 😸 تعال فتح حلكك 😸💙" 
end
if msg.text =="وين ولك" then 
return  "يم خالتك الشكره بن  الصاكه" 
end
if msg.text =="اكرهك" then 
return  "شعور متبادل حبي" 
end
if msg.text =="تكرهني" then 
return  "شي اكيد احبك حياتي 😸💛" 
end
if msg.text =="اعشقك" then 
return  "فيدوه اني هم عشقك😊😹🙊" 
end
if msg.text =="شباب" then 
return  "كباب وتكه وسمج 😸😸💛" 
end
if msg.text =="ماريا" then 
return  "ولك هاي الصاكه العشق هاي حبيبت المطور هاي 😸🙊😻😻️" 
end
if msg.text =="😂😂😂😂😂😂" then 
return  "يضحك الفطير 😹😹" 
end
if msg.text =="😇" then 
return  "استريح بحي رايد شي 😹😹😻" 
end
if msg.text =="😖" then 
return  "دي وجهك معقد 😹😹" 
end
if msg.text =="😄" then 
return  "حيل فتح حلكك نوب 😹😹😘" 
end
if msg.text =="😌😌😌😌😌" then 
return  "فديت الغرور كله بحي" 
end
if msg.text =="😭😭😭😭😭" then 
return  "منو ويك حياتي بس كلي اله اهينه كدامك 😹😹" 
end
if msg.text =="😫" then 
return  "ها بحي منو مضوجك 😍😻" 
end
if msg.text =="☻" then 
return  "عساس ثكيل العينتين تاليتك تزحفبل خاص 😹😹" 
end
if msg.text =="😠" then 
return  "طفه طفه 💦💦 تره حمه حيل" 
end
if msg.text =="😳😳😳😳😳" then 
return  "ها شفت/ي ابوك/ج مصلخ ونصدمت 😹😹" 
end
if msg.text =="😹" then 
return  "اضحك شكو عله كلبك ☹😹" 
end
if msg.text =="🙊🙊🙊🙊🙊" then 
return  "ها قردي شبيك مستحي 😂😂" 
end
if msg.text =="🙈🙈🙈🙈🙈" then 
return  "صار/ت قرد يعني خجلان ?😹😹😹" 
end
if matches[1]=="بوت" and is_sudo(msg) then 
return  "تاج راسي كول حبيبي 😻🙊😚" 
end
if msg.text =="بوت" and is_admin(msg) then 
return "ها حياتي المدير 😻اامرني كلبي 😇🙊" 
end
if msg.text =="بوت" and is_owner(msg) then 
return "ها حياتي المدير 😻اامرني كلبي 😇🙊" 
end
if msg.text =="بوت" and is_mod(msg) then 
return "ها احجي شتريد 😏 صيحلي باسمي بعد لدكول بوت😹😢🚶" 
end
if msg.text =="بوت" then 
return  "نجب لك صارت قديمه صيحلي باسمي 😒👬💛" 
end 
if matches[1]=="ستورم" and is_sudo(msg) then 
return  "عيونه لستورم يبعد كلبي 😻🙊😹" 
end
if msg.text =="ستورم" and is_admin(msg) then 
return "حياتي انت كول بعد روحي 😽🙊" 
end
if msg.text =="ستورم" and is_owner(msg) then 
return "تفضل تاج راسي 😻🙊" 
end
if msg.text =="ستورم" and is_mod(msg) then 
return "تفصل يروحتي 😍😻" 
end
if msg.text =="ستورم" then 
return "فضها كول شرايد تعبتوني😢😞" 
------------------------------ 
end 
if msg.text =="معلوماتي" and is_sudo(msg) then 
return  "انت الكلب الي ماعيش من دونه 😻🙊" 
end
if msg.text =="معلوماتي" and is_admin(msg) then 
return "انت اداري يرويحتي 😽🙈" 
end
if msg.text =="معلوماتي" and is_owner(msg) then 
return "انت تاج راسي المدير 😍😘" 
end
if msg.text =="معلوماتي" and is_mod(msg) then 
return "انت صديقي الادمن 💔💋" 
end
if msg.text =="معلوماتي" then 
return  "هو انت مجرد عضو 😒😅" 
end 
if matches[1]=="شنو اني" and is_sudo(msg) then 
return  "انت حياتي المطور 💋😽" 
end
if msg.text =="شنو اني" and is_admin(msg) then 
return "انت الاداري يكلبي 😍🙈" 
end
if msg.text =="شنو اني" and is_owner(msg) then 
return "انت المدير النفس كله 😻☺" 
end
if msg.text =="شنو اني" and is_mod(msg) then 
return "يا صديقي انت الادمن 💛🌚" 
end
if msg.text =="شنو اني" then 
return "انت عضو لا تحل ولا تربط 😹😻" 
------------------------------ 
end 
end

return { 
  patterns = { 
"^(عرفنا)$", 
"^(شسمك)$", 
"^(خلي نتعرف)$", 
"^(نت منين)$", 
"^(نتعرف)$",
"^(عرفينا)$", 
"^(نكبل)$", 
"^(نرتبط)$", 
"^(قناه)$", 
"^(اريد قناه)$", 
"^(قناة)$", 
"^(اريد قناة)$", 
"^(@TAHAJ20)$", 
"^(خليجي صاك)$", 
"^(خليجي)$", 
"^(طه)$", 
"^(🙄)$", 
"^(🙄🙄)$", 
"^(🙄🙄🙄)$", 
"^(🙄🙄🙄🙄)$",
"^(💐)$", 
"^(🍁)$", 
"^(🌺)$", 
"^(🐅)$", 
"^(🐅🐅)$", 
"^(🐅🐅🐅)$", 
"^(🐍🐍🐍🐍)$", 
"^(🐍🐍🐍)$", 
"^(🐍🐍)$", 
"^(🐍)$", 
"^(🌝)$", 
"^(🌝🌝)$", 
"^(🌝🌝🌝)$", 
"^(🌝🌝🌝🌝)$", 
"^(🌹)$",
"^(🐈)$", 
"^(🐆)$", 
"^(🐕)$", 
"^(🙋🙋🙋🙋)$", 
"^(🙋🙋🙋)$", 
"^(🙋🙋)$", 
"^(🙋)$", 
"^(💋)$", 
"^(💋💋)$", 
"^(💋💋💋)$", 
"^(💋💋💋💋)$", 
"^(💚)$", 
"^(❤)$", 
"^(💜)$", 
"^(💙)$",
"^(💛)$", 
"^(💔💔💔💔)$", 
"^(💔💔💔)$", 
"^(💔💔)$", 
"^(💔)$", 
"^(😾😾😾)$", 
"^(😾😾)$", 
"^(😾)$", 
"^(😽😽😽😽)$", 
"^(😽😽😽)$", 
"^(😽😽)$", 
"^(😽)$", 
"^(😴😴😴😴)$", 
"^(😴😴😴)$", 
"^(😴😴)$",
"^(😴)$", 
"^(😎)$", 
"^(😎😎)$", 
"^(😎😎😎)$", 
"^(😎😎😎😎)$", 
"^(😋😋😋😋)$", 
"^(😋😋😋)$", 
"^(😋😋)$", 
"^(😋)$", 
"^(😐😐😐😐)$", 
"^(😐😐😐)$", 
"^(😐😐)$", 
"^(😐)$", 
"^(😑)$", 
"^(😑😑)$",
"^(😑😑😑)$", 
"^(😑😑😑😑)$", 
"^(😔😔😔😔)$", 
"^(😔😔😔)$", 
"^(😔😔)$", 
"^(😔)$", 
"^(🚶🏻)$", 
"^(🚶🏻🚶🏻)$", 
"^(🚶🏻🚶🏻🚶🏻)$", 
"^(🚶🏻🚶🏻🚶🏻🚶🏻)$", 
"^(🚶‍♀️🚶‍♀️🚶‍♀️🚶‍♀️)$", 
"^(🚶‍♀️🚶‍♀️🚶‍♀️)$", 
"^(🚶‍♀️🚶‍♀️)$", 
"^(🚶‍♀️)$", 
"^(😕)$",
"^(😕😕)$", 
"^(😕😕😕)$", 
"^(😕😕😕😕)$", 
"^(😝😝😝😝)$", 
"^(😝😝😝)$", 
"^(😝😝)$", 
"^(😝)$", 
"^(😒😒😒😒)$", 
"^(😒😒😒)$", 
"^(😒😒)$", 
"^(😒)$", 
"^(😏)$", 
"^(😏😏)$", 
"^(😏😏😏)$", 
"^(😏😏😏😏)$",
"^(😿)$", 
"^(😿😿)$", 
"^(😿😿😿)$", 
"^(😿😿😿😿)$", 
"^(😹😹😹😹)$", 
"^(😹😹😹)$", 
"^(😹😹)$", 
"^(😹)$", 
"^(😢)$", 
"^(😢😢)$", 
"^(😢😢😢)$", 
"^(😢??😢😢)$", 
"^(🚶🚶🚶🚶)$", 
"^(🚶🚶🚶)$", 
"^(🚶🚶)$",
"^(🚶)$", 
"^(😇)$", 
"^(😇😇)$", 
"^(😻😻😻😻)$", 
"^(😻😻😻)$", 
"^(😻😻)$", 
"^(😻)$", 
"^(😞😞😞😞)$", 
"^(😞😞😞)$", 
"^(😞😞)$", 
"^(😞)$", 
"^(☺)$", 
"^(☺☺)$", 
"^(☺☺☺)$", 
"^(☺☺☺☺)$",
"^(😘😘😘😘)$", 
"^(😘😘😘)$", 
"^(😘😘)$", 
"^(😘)$", 
"^(😊😊😊😊)$", 
"^(😊😊😊)$", 
"^(😊😊)$", 
"^(😊)$", 
"^(😱)$", 
"^(😱😱)$", 
"^(😱😱😱)$", 
"^(😱😱😱😱)$", 
"^(👀)$", 
"^(👀👀)$", 
"^(💃)$",
"^(💃💃💃)$", 
"^(💃💃)$", 
"^(💃💃💃💃)$", 
"^(😌😌😌😌)$", 
"^(😌😌😌)$", 
"^(😌😌)$", 
"^(😌)$", 
"^(😭)$", 
"^(😭😭😭)$", 
"^(😭😭)$", 
"^(😡😡😡😡)$", 
"^(😭😭😭😭)$", 
"^(😡😡😡)$", 
"^(😡😡)$", 
"^(😡)$",
"^(😠😠😠😠)$", 
"^(😠😠😠)$", 
"^(😠😠)$", 
"^(😠)$", 
"^(😳)$", 
"^(😳😳)$", 
"^(😳😳😳)$", 
"^(😳😳😳😳)$", 
"^(😉😉😉😉)$", 
"^(😉😉😉)$", 
"^(😉😉)$", 
"^(😉)$", 
"^(😂)$", 
"^(😂😂)$", 
"^(😂😂😂)$",
"^(😂😂😂😂)$", 
"^(😍😍😍😍)$", 
"^(😍😍😍)$", 
"^(😍😍)$", 
"^(😍)$", 
"^(🙊🙊🙊🙊)$", 
"^(🙊🙊🙊)$", 
"^(🙊🙊)$", 
"^(🙊)$", 
"^(🙈)$", 
"^(🙈🙈)$", 
"^(🙈🙈🙈)$", 
"^(🙈🙈🙈🙈)$", 
"^(🚶🏻🚶🏻🚶🏻🚶🏻)$", 
"^(🚶🏻🚶🏻🚶🏻)$",
"^(🚶🏻🚶🏻)$", 
"^(🚶🏻)$", 
"^(🌚)$", 
"^(🌚🌚)$", 
"^(🌚🌚🌚)$", 
"^(🌚🌚🌚🌚)$", 
"^(ايي)$", 
"^(اييي)$", 
"^(اييييي)$", 
"^(احبكم)$", 
"^(احبككك)$", 
"^(ااحبك)$", 
"^(احبكك)$", 
"^(ولي)$", 
"^(وليي)$",
"^(ولييي)$", 
"^(وليييي)$", 
"^(دي)$", 
"^(ديي)$", 
"^(دييي)$", 
"^(ديييي)$", 
"^(مممكن)$", 
"^ببكن()$", 
"^(ممكن)$", 
"^(ممكنن)$", 
"^(اجييي)$", 
"^(اجي)$", 
"^(اجيييي)$", 
"^(رايح)$", 
"^(راح اروح)$",
"^(اروحح)$", 
"^(اروح)$", 
"^(ضايج)$", 
"^(ضايجين)$", 
"^(ضوجه)$", 
"^(ضوجهه)$", 
"^(ضوججه)$", 
"^(ضووجهه)$", 
"^(حيل ضايجه)$", 
"^(ضايجهه)$", 
"^(ضايجه)$", 
"^(شلونجن)$", 
"^(شخبارج)$", 
"^(شلونج)$", 
"^(شونج)$",
"^(ادوم)$", 
"^(دومج)$", 
"^(دومك)$", 
"^(ددوم)$", 
"^(دوم)$", 
"^(دووووم)$", 
"^(دوووم)$", 
"^(صباح الخير)$", 
"^(صباحوو)$", 
"^(صباحو)$", 
"^(صباحووو)$", 
"^(تصبحين عله خير)$", 
"^(تصبحي عله خير)$", 
"^(تصبحون عله خير)$", 
"^(ت ع خ)$",
"^(نعسان)$", 
"^(راح انام)$", 
"^(تصبح عله خير)$", 
"^(💋💋💋💋)$", 
"^(💋💋💋)$", 
"^(💋💋)$", 
"^(💋)$", 
"^(🖕🖕🖕🖕)$", 
"^(🖕🖕🖕)$", 
"^(🖕🖕)$", 
"^(🖕)$", 
"^(🤔🤔🤔🤔)$", 
"^(🤔🤔🤔)$", 
"^(🤔🤔)$", 
"^(🤔)$",
"^(تلعبون)$", 
"^(نلعب)$", 
"^(تعاي نلعب)$", 
"^(تعال نلعب)$", 
"^(مطور)$", 
"^(المطور)$", 
"^(وين البوت)$", 
"^(هاذا بوت)$", 
"^(اي بوت)$", 
"^(يمكن بوت)$", 
"^(هاذا شنو)$", 
"^(شونكم)$", 
"^(شونك)$", 
"^(شلونك)$", 
"^(شلونكم)$",
"^(باييي)$", 
"^(بايي)$", 
"^(باااااي)$", 
"^(باااي)$", 
"^(بااي)$", 
"^(باي)$", 
"^(ووين)$", 
"^(وين تريد)$", 
"^(وينن)$", 
"^(وين)$", 
"^(اانجب)$", 
"^(نجب)$", 
"^(انجب)$", 
"^(جب)$", 
"^(شبيكمم)$",
"^(شبيكك)$", 
"^(شبيكم)$", 
"^(شبيك)$", 
"^(تعالوووو)$", 
"^(تعالووو)$", 
"^(تعالوو)$", 
"^(تعالو)$", 
"^(اي)$", 
"^(☹️☹️☹️☹️)$",
"^(☹️☹️☹️)$", 
"^(🙂✌️)", 
"^(🙁💔)$", 
"^(🙄🤞🏿)$", 
"^(😕😕😕😕)$", 
"^(🙂🙂🙂🙂)$", 
"^(☹️)$", 
"^(☹️☹️)", 
"^(😹😹😹😹😹😹😹😹😹😹)$", 
"^(هه)$",
"^(ههه)$", 
"^(هههه)", 
"^(ههههه)$", 
"^(ههههههه)$", 
"^(هههههههه)$", 
"^(ههههههههه)$", 
"^(هههههههههه)$", 
"^(😹😹😹😹😹😹)", 
---
"^(🙈🙈🙈🙈🙈)$", 
"^(🙊🙊🙊🙊🙊)$", 
"^(😹)$", 
"^(😳😳😳😳😳)$", 
"^(😠)$",
"^(☻)$", 
"^(😫)$", 
"^(😭😭😭😭😭)$", 
"^(😌😌😌😌)$", 
"^(😄)$", 
"^(😖)$", 
"^(😂😂😂😂😂😂)$", 
"^(😇)$", 
"^(ماريا)$", 
"^(بوت)", 
"^(شباب)$", 
"^(اعشقك)$", 
"^(تكرهني)$", 
"^(اكرهك)$", 
"^(وين ولك)$", 
"^(انت انجب)$",
"^(سلام)$", 
"^(خرب)$", 
"^(هلاوووووو)$", 
"^(شلونكم)$", 
"^(هاي)$", 
"^(مرحبا)$", 
"^(انكليزي)$", 
"^(كول انجب)$", 
"^(نيجه)$", 
"^(الله)$", 
"^(ولو منا)$", 
"^(يوجع)$", 
"^(كحبه)$", 
"^(اوي)$", 
"^(وف)$",
"^(نصعد)$", 
"^(فرخ)$", 
"^(شغال)$", 
"^(صوفي)$", 
"^(تعال)$", 
"^(تعالي خاص)$", 
"^(تعال خاص)$", 
"^(خاص)$", 
"^(ستورم)$", 
"^(شنو اني)$", 
"^(احبج)$", 
"^(اكول)$", 
"^(اكلك)$", 
"^(حقك)$", 
"^(والرب)$", 
"^(كلكم)$", 
"^(بربك)$",

    }, 
  run = run 
} 

